<?php
//注意：在PHP中，算术运算符只能做数学运算
echo '10' + '20','<br>';       //30
echo '10ab' + '20cd','<br>';       //30
echo 'ab10' + 'cd20','<br>';       //0

//++前置：先自增再运算
//++后置：先运算再自增

$num = 10;
$num++;
echo $num;    //11,不管前后都是11
echo $num++;  //11
echo ++$num;  //12

//比较运算符的运算结果是布尔值

//逻辑运算符
/**
 * &  与：运算符两边的表达式都要计算
 * |
 * &&  短路与   如果前面的跳呢不满足，后面的条件就不需要计算了
 * ||  短路或
 * !
 */

$a=5;
$b=10;
if ($a>10 && ++$a<20) {
    echo '123123';
}
echo $a;
if ($a<10 & ++$a<20) {
    echo '123123';
}

echo $a;

//字符串连接符
echo 'a'.'b';

//错误抑制符
//错误抑制符只对表达式有效
echo @($a+$b);

//三元运算符
//表达式？值1:值2

//null合并运算符
echo $name??'姓名不详';

//isset判断变量是否被设置，并且设置的不是null
//empty检查一个变量是否为空，能转成false全部是空['', 0,0.0,array(),null]
echo isset($name)?$name:'姓名不详';

$stu = array();
echo empty($stu)?'空':'非空';








