<?php
//注意：在PHP中，算术运算符只能做数学运算
echo '10' + '20','<br>';       //30
echo '10ab' + '20cd','<br>';       //30
echo 'ab10' + 'cd20','<br>';       //0

//++前置：先自增再运算
//++后置：先运算再自增

$num = 10;
$num++;
echo $num;    //11,不管前后都是11
echo $num++;  //11
echo ++$num;  //12

//比较运算符的运算结果是布尔值

//逻辑运算符
/**
 * &  与：运算符两边的表达式都要计算
 * |
 * &&  短路与   如果前面的跳呢不满足，后面的条件就不需要计算了
 * ||  短路或
 * !
 */

$a=5;
$b=10;
if ($a>10 && ++$a<20) {
    echo '123123';
}
echo $a;
if ($a<10 & ++$a<20) {
    echo '123123';
}

echo $a;









